openfoam-case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========|                                                                  |
| \\      /  F ield | OpenFOAM: The Open Source CFD Toolbox                   |
|  \\    /   O peration | Version:  11                                        |
|   \\  /    A nd | Website:  www.openfoam.org                                |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1; // 0.1

writeControl    timeStep; // adjustableRunTime;

writeInterval   1;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no // yes;

maxCo           1;

functions
{
    forces
    {
        type            forces;
        libs            ( "libforces.so" );
        writeControl    timeStep;
        writeInterval   10;
        patches         ( porousInterface );
        rho             rhoInf;
        rhoInf          1;
        CofR            ( 0 0 0 );
    }
    meanVelocity
    {
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        fields          ( U );
        operation       volAverage;
        select          all;
    }
    volIntegrateUx
    {
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        fields          ( U );
        operation       volIntegrate;
        select          all;
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
    }
    residuals
    {
        type            residuals;
        libs            ( "libutilityFunctionObjects.so" );
        writeControl    timeStep;
        writeInterval   10;
        fields          ( U p );
    }
}

// ************************************************************************* //
