openfoam-case/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========|                                                                  |
| \\      /  F ield | OpenFOAM: The Open Source CFD Toolbox                   |
|  \\    /   O peration | Version:  11                                        |
|   \\  /    A nd | Website:  www.openfoam.org                                |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;  // must be uniformDimensionedVectorField
    location    "constant";
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];  // [L/T^2]
value           (1 0 0);