openfoam-case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========|                                                                  |
| \\      /  F ield | OpenFOAM: The Open Source CFD Toolbox                   |
|  \\    /   O peration | Version:  11                                        |
|   \\  /    A nd | Website:  www.openfoam.org                                |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1.0;
rhoInf          1;

// ************************************************************************* //
